import logging
import pytest

from nlp.methods import (
    extract_stopwords,
    extract_keywords,
    extract_entities,
    summarize_doc,
    summarize,
    extractive_summarization,
    extract_quotes,
    extract_claims,
    extract_topics
)

from ai.model import AIModel


test_model = AIModel("models/el.json")
# test_text = 'Ο πρωθυπουργός παραδέχθηκε εμμέσως ότι η επιδότηση για τα καύσιμα και τα μέτρα κατά των ανατιμήσεων, είναι αυτά που επιβάλλουν τα δημοσιονομικά περιθώρια. Σταγόνα στον ωκεανό της ακρίβειας η κυβερνητική παρέμβαση. “Ουκ αν λάβοις παρά του μη έχοντος”: Η αρχαία αυτή ρήση έχει ουσιαστικά εφαρμογή και όσον αφορά στα μέτρα κατά της ακρίβειας, καθώς η επιδότηση στην τιμή των καυσίμων είναι μικρή σε σχέση με τις τεράστιες ανατιμήσεις με την κυβέρνηση να επικαλείται τα στενά δημοσιονομικά περιθώρια. Ο πρωθυπουργός Κυριάκος Μητσοτάκης μάλιστα στο χθεσινό του μήνυμα εν όψει των λεπτομερών ανακοινώσεων σήμερα, αξύριστος και ταλαιπωρημένος από τον κορονοϊό, έσπευσε χθες να προκαταλάβει τυχόν κριτική της αντιπολίτευσης για “ψίχουλα”, δηλώνοντας ότι και ο ίδιος θα ήθελε να δώσει ένα μεγαλύτερο πακέτο στήριξης. Τόνισε όμως ότι δεν μπορεί να θέσει σε κίνδυνο τη δημοσιονομική σταθερότητα και ότι δεν θα ξεπεράσει τις αντοχές της οικονομίας. Πολύ λίγα, πολύ αργά Σύμφωνα με πληροφορίες άλλωστε, στο οικονομικό επιτελείο είχαν επιφυλάξεις για τη δυνατότητα μέτρων στήριξης, καθώς δεν υπήρχαν περισσότερα χρήματα για να διατεθούν από το 1,1 δισ ευρώ που συνολικά θα δοθεί, ενώ το οικονομικό μέλλον είναι αβέβαιο. Η κυβέρνηση εξάλλου έχει ξεκαθαρίσει ότι δεν θα προχωρήσει σε μείωση του φόρου καυσίμων όπως έκανε πχ η Πορτογαλία, καθώς αποτελεί ένα πολύ μεγάλο μέρος των δημοσίων εσόδων. Επί της ουσίας ο κ.Μητσοτάκης εμμέσως παραδέχθηκε ότι τα νέα μέτρα προφανώς και δεν λύνουν το πρόβλημα, αλλά στην πραγματικότητα αποτελούν ένα μικρό βοήθημα, σταγόνα στον ωκεανό της ακρίβειας. Είναι ενδεικτικό ότι η επιδότηση σε βενζίνη κλπ αναμένεται να φτάσει τα 0,20 ευρώ το λίτρο, που σημαίνει περίπου 15 ευρώ το μήνα, ενώ ο “κόφτης” των 180 λίτρων σε βάθος τριμήνου δεν καλύπτει ούτε την ανάγκη σε καύσιμα για ένα μέσο ΙΧ το μήνα. Το πολιτικό μήνυμα του Μαξίμου λοιπόν είναι “κάνουμε ό,τι μπορούμε” και όχι τυχαία ο πρωθυπουργός κράτησε χαμηλούς τόνους στη χθεσινή του δήλωση. Δεν είναι τυχαίο επίσης ότι αναφέρθηκε στους ευάλωτους, αλλά και στη μεσαία τάξη, την οργή της οποίας φοβάται η κυβέρνηση. Αλλά και ότι δήλωσε πως “είναι η ώρα η πολιτική να θέσει κανόνες στις αγορές”, χωρίς να μπαίνει σε περισσότερες λεπτομέρειες επ’ αυτού. Ήδη άλλωστε ο πρωθυπουργός έχει κάνει λόγο για κερδοσκοπία στην αγορά καυσίμων και φυσικού αερίου. Το βλέμμα στην ΕΕ Ο κ.Μητσοτάκης στη δήλωση του χθες έδειξε επίσης ότι προσδοκά στην επικείμενη Σύνοδο Κορυφής της Ευρωπαϊκής Ένωσης στις 24 και 25 Μαρτίου να ληφθούν μέτρα σε ευρωπαϊκό επίπεδο για να συγκρατηθούν οι τιμές του φυσικού αερίου, του ηλεκτρικού ρεύματος και των καυσίμων εν γένει, καθώς και για να δοθεί η δυνατότητα στα κράτη- μέλη να δώσουν περισσότερα. Η προσδοκία αυτή “σκοντάφτει” όμως στις αντιρρήσεις της Γερμανίας, της Ολλανδίας και των λεγόμενων “φειδωλών” χωρών του Βορρά, που αντιδρούν και στο ευρωομόλογο, με το επιχείρημα ότι υπάρχουν ακόμη κονδύλια στο Ταμείο Ανάκαμψης. Το οποίο Ταμείο Ανάκαμψης όμως έχει τέτοιους όρους, που η εκταμίευση δεν είναι εύκολη υπόθεση. Το ζήτημα για την κυβέρνηση είναι επίσης ότι επικοινωνιακά περνά κάτω από τον πήχη που είχε θέσει η οριζόντια διάθεση 42 δισ ευρώ για μέτρα στήριξης την περίοδο της πανδημίας. Τότε βεβαίως, η δυνατότητα αυτή υπήρχε γιατί σε ευρωπαϊκό επίπεδο είχαν χαλαρώσει οι δημοσιονομικές πολιτικές. Ενώ τώρα, δεδομένου του μισοάδειου “κορβανά”, η κυβέρνηση επιλέγει πιο στοχευμένες δράσεις, προσπαθώντας όμως ταυτόχρονα να απευθυνθεί και στη μεσαία τάξη, έστω με μία μικρή επιδότηση για τα εισοδήματα μέχρι 30.000 ευρώ.'
test_text = 'Οι φιλορώσοι αυτονομιστές αντάρτες στην ανατολική Ουκρανία κατηγόρησαν σήμερα τον στρατό ότι άνοιξε πυρ εναντίον της περιοχής που ελέγχουν τέσσερις φορές μέσα σε διάστημα 24 ωρών και πρόσθεσαν ότι προσπαθούν να βεβαιωθούν ότι δεν υπάρχουν θύματα. Δεν είναι ακόμη ξεκάθαρο πόσο σοβαρά είναι αυτά τα περιστατικά και προς το παρόν δεν έχει υπάρξει αντίδραση από την Ουκρανία ή τον Οργανισμό για την Ασφάλεια και τη Συνεργασία στην Ευρώπη (ΟΑΣΕ), ο οποίος παρακολουθεί την κατάσταση στην ανατολική Ουκρανία αλλά τις τελευταίες ημέρες έχει αποσύρει κάποιους από τους παρατηρητές του από την περιοχή. Τέτοιου είδους περιστατικά έχουν σημειωθεί πολλές φορές τα τελευταία οκτώ χρόνια, αλλά αυτό σημειώνεται σε μια περίοδο που η Ρωσία κατηγορείται ότι έχει συγκεντρώσει περισσότερους από 100.000 στρατιώτες στα σύνορά με την Ουκρανία και έχει αποσύρει κάποιους από τους παρατηρητές της τις τελευταίες ημέρες. Εκπρόσωποι της αυτοανακηρυχθείσας Λαϊκής Δημοκρατίας του Λουχάνσκ ανέφεραν σε ανακοίνωσή τους ότι οι ουκρανικές δυνάμεις χρησιμοποίησαν όλμους, εκτοξευτήρες ρουκετών και πολυβόλα σε τέσσερα ξεχωριστά περιστατικά σήμερα Πέμπτη. “ Οι ένοπλες δυνάμεις της Ουκρανίας έχουν παραβιάσει κατάφωρα το καθεστώς εκεχειρίας χρησιμοποιώντας βαρέα όπλα τα οποία, βάσει των συμφωνιών του Μινσκ, θα έπρεπε να έχουν αποσυρθεί”, τόνιζε η ανακοίνωση. Το Κίεβο αρνείται ότι στοχοθέτησε θέσεις των φιλορώσων αυτονομιστών ανταρτών στα ανατολικά Ο ουκρανικός στρατός διέψευσε σήμερα ότι στοχοθέτησε τους φιλορώσους αυτονομιστές αντάρτες στην ανατολική Ουρκανία. "Παρά το γεγονός ότι οι θέσεις μας δέχθηκαν από απαγορευμένα όπλα, περιλαμβανομένων πυροβόλων 12 χιλιοστών, τα ουκρανικά στρατεύματα δεν απάντησαν στα πυρά", δήλωσε στο Reuters ο υπεύθυνος Τύπου των ουκρανικών ενόπλων δυνάμεων. Νωρίτερα οι φιλορώσοι αυτονομιστές αντάρτες στην ανατολική Ουκρανία κατηγόρησαν τον στρατό ότι άνοιξε πυρ εναντίον της περιοχής που ελέγχουν τέσσερις φορές μέσα σε διάστημα 24 ωρών και πρόσθεσαν ότι προσπαθούν να βεβαιωθούν ότι δεν υπάρχουν θύματα. Δεν είναι ακόμη ξεκάθαρο πόσο σοβαρά είναι αυτά τα περιστατικά και προς το παρόν δεν έχει υπάρξει αντίδραση από την Ουκρανία ή τον Οργανισμό για την Ασφάλεια και τη Συνεργασία στην Ευρώπη (ΟΑΣΕ), ο οποίος παρακολουθεί την κατάσταση στην ανατολική Ουκρανία αλλά τις τελευταίες ημέρες έχει αποσύρει κάποιους από τους παρατηρητές του από την περιοχή. Τέτοιου είδους περιστατικά έχουν σημειωθεί πολλές φορές τα τελευταία οκτώ χρόνια, αλλά αυτό σημειώνεται σε μια περίοδο που η Ρωσία κατηγορείται ότι έχει συγκεντρώσει περισσότερους από 100.000 στρατιώτες στα σύνορά με την Ουκρανία και έχει αποσύρει κάποιους από τους παρατηρητές της τις τελευταίες ημέρες. Εκπρόσωποι της αυτοανακηρυχθείσας Λαϊκής Δημοκρατίας του Λουχάνσκ ανέφεραν σε ανακοίνωσή τους ότι οι ουκρανικές δυνάμεις χρησιμοποίησαν όλμους, εκτοξευτήρες ρουκετών και πολυβόλα σε τέσσερα ξεχωριστά περιστατικά σήμερα Πέμπτη. “ Οι ένοπλες δυνάμεις της Ουκρανίας έχουν παραβιάσει κατάφωρα το καθεστώς εκεχειρίας χρησιμοποιώντας βαρέα όπλα τα οποία, βάσει των συμφωνιών του Μινσκ, θα έπρεπε να έχουν αποσυρθεί”, τόνιζε η ανακοίνωση. Σύμφωνα με τον Γιαν Λεστσένκο επικεφαλής της λαϊκής πολιτοφυλακής του Λουχάνσκ, "τις τελευταίες 24 ώρες η κατάσταση στη γραμμή επαφής έχει επιδεινωθεί σημαντικά. Ο εχθρός, υπό την άμεση εντολή της πολιτικοστρατιωτικής ηγεσίας του Κιέβου, προσπαθεί να κλιμακώσει τη σύγκρουση". Παράλληλα η λαϊκή πολιτοφυλακή της αυτοανακηρυχθείσας Λαϊκής Δημοκρατίας του Ντονέτσκ ανακοίνωσε σήμερα ότι μονάδες της απάντησαν σε πυρά που δέχθηκαν από τις ουκρανικές δυνάμεις ασφαλείας. “ Προκειμένου να προστατεύσουμε τον άμαχο πληθυσμό, οι υπερασπιστές μας αναγκάστηκαν να απαντήσουν στα πυρά (...) Δεν υπάρχουν ακόμη πληροφορίες για θύματα ή ζημιές στις πολιτικές υποδομές”, επεσήμανε ο εκπρόσωπος της πολιτοφυλακής.'
# test_text = 'Οι κάτοικοι της Φαρκαδόνας Τρικάλων προχώρησαν σε ομαδική μήνυση αφού υποστηρίζουν ότι με το σπάσιμο αναχωμάτων στον Ενιπέα πλημμύρισε το χωριό τους. Σε ομαδική μήνυση προχωρούν κάτοικοι της Φαρκαδόνας Τρικάλων αφού υποστηρίζουν ότι με το σπάσιμο αναχωμάτων στον ποταμό Ενιπέα πλημμύρισε το χωριό τους, όπως και άλλα, για να γλιτώσουν οι πόλεις της Θεσσαλίας. Σύμφωνα με το trikalaola.gr, περίπου 30 είναι οι κάτοικοι του χωριού που κατέθεσαν την ομαδική μήνυση, κατηγορώντας ευθέως την τοπική αυτοδιοίκηση για την καταστροφή του φράγματος. «Το χωριό δεν πρόκειται να ξανακατοικηθεί τα επόμενα, θα έλεγα, 1-2 χρόνια» Ο δικηγόρος των κατοίκων, Γιώργος Μπαρτζώκης κατηγόρησε ευθέως την τοπική αυτοδιοίκηση (ενώ ενέπλεξε και το υπουργείο Κλιματικής Κρίσης και Πολιτικής Προστασίας) ότι έσπασε το φράγμα του Ενιπέα, με σκοπό τα νερά των πλημμυρών αντί για την Καρδίτσα να πάνε στα γύρω χωριά, μεταξύ των οποίων και η Φαρκαδόνα. Όπως είπε, μιλώντας στον Ant1, υπάρχει φωτογραφικό υλικό από τα σπασμένα σημεία και κατήγγειλε πως το ίδιο έγινε και σε φράγμα της Λάρισας, στη Γυρτώνη. «Έλαβα την εξουσιοδότηση από κατοίκους της Φαρκαδόνας, από περίπου 30 κατοίκους που θα καταθέσουν και ως μάρτυρες, οι οποίοι κατηγορούν κάποιους που πήγαν και χτύπησαν το ανάχωμα του Ενιπέα σε δυο σημεία – υπάρχουν αντίστοιχες φωτογραφίες που θα παραδώσουμε στις δικαστικές Αρχές. Τώρα ερευνάται ποιος πήγε σε αυτές τις δύο περιοχές και ποιος έδωσε την εντολή. Το πιο πιθανό είναι ότι μιλάμε για μία επικοινωνία της τοπικής αυτοδιοίκησης της περιοχής – που ερευνάμε και εμείς σε ποιον βαθμό εμπλέκεται με τον κ. Κικίλια», είπε ο δικηγόρος. «Στη Φαρκαδόνα έχουν καταστραφεί όλα τα σπίτια, το νερό ήταν 30 μέτρα. Επαγγελματίας που είχε συνεργείο αυτοκινήτων, καταστράφηκαν όλα τα αυτοκίνητά του, αξίας εκατομμυρίων. Το χωριό δεν πρόκειται να ξανακατοικηθεί τα επόμενα, θα έλεγα, 1-2 χρόνια, είναι πάρα πολύ το νερό», συμπλήρωσε. «Υπάρχουν φωτογραφίες από δύο σπασμένα σημεία. Και δεν είναι μόνο αυτό. Συνέχισαν το έγκλημα γιατί εδώ η διαδικασία του ελέγχου έπρεπε να γίνει από τον κ. Κικίλια, την Πολιτική Προστασία. Άφησαν κατοίκους στη Φαλάνη Λάρισας να πάνε να χτυπήσουν το φράγμα της Γυρτώνης. Για αυτό πλημμύρισε η Εθνική Οδός. Υπάρχει βίντεο», δήλωσε ακόμη ο δικηγόρος. Παρόμοια καταγγελία και από κάτοικο του Παλαμά Υπενθυμίζεται ότι ο κ. Ιωάννης Θωμάς, κάτοικος του Παλαμά και εργολήπτης τεχνικών έργων, κατήγγειλε στο  in  ότι έγινε λάθος σε σπάσιμο αναχώματος με αποτέλεσμα τα νερά να κατευθυνθούν προς τα χωριά. «Ο Παλαμάς έχει πλημμυρίσει από τα νερά που έσπασαν από το ανατολικό κομμάτι του ποταμού Φαρσαλίτη και δυτικά από τα νερά που είναι στην ίδια στάθμη που ήρθανε από τον ποταμό Καλέντζη», είπε. Κάτοικος του Παλαμά κατήγγειλε ότι έσπασαν λάθος ανάχωμα με αποτέλεσμα να πλημμυρίσουν χωριά Ο κάτοικος του Παλαμά κατήγγειλε ότι δεν έσπασαν το ανάχωμα «από την πλευρά που δεν είχαμε πόλη», υπογραμμίζοντας ότι «από από την πλευρά τους, τη δυτική, τα νερά θα πηγαίνανε μέσω της κλίσης του εδάφους στον συλλεκτήρα στο Κεραμίδι και εκεί υπάρχει και αντλιοστάσιο, το οποίο θα το τράβαγε (σ.σ. το νερό) με την ησυχία του, όσο καιρό και να έκανε. Θα το πήγαινε εκεί που έπρεπε να το πάει, στον Πηνειό». «Θα φιλοξενούσαμε δηλαδή τα νερά αυτά μέσα σε ένα αγρόκτημα κατεστραμμένο για όσο καιρό θέλαμε. Θα είχαμε, όμως, σώσει το ανάχωμα που είναι στους οικισμούς Παλαμά, Μεταμόρφωση και Βλοχό και θα είχαμε την ασφάλεια των οικισμών. Με λίγα λόγια, όλος ο τόπος που έπαθε ζημιά βρίσκεται ανάμεσα σε δύο ποτάμια. Αντί η Πολιτεία να σπάσει, εφόσον δεν μπορούσε να τα διαχειριστεί, τα εξωτερικά αναχώματα και να κρατήσει τα χωριά και την πόλη ασφαλή, δυστυχώς έσπασαν τα εσωτερικά. Αυτό το καταγγέλλω δημόσια», είπε ο ίδιος. in.gr'

@pytest.mark.asyncio
async def test_extract_quotes() -> None:
    quotes = await extract_quotes(test_text)
    assert len(quotes) == 5
    logging.info(quotes)


@pytest.mark.asyncio
async def test_extract_stopwords() -> None:
    stopwords = await extract_stopwords(
        test_text, list(test_model.spacy.Defaults.stop_words)
    )
    assert len(stopwords) == 239
    logging.getLogger().info(stopwords)


@pytest.mark.asyncio
async def test_extract_keywords() -> None:
    doc = test_model.spacy(test_text)
    keywords = await extract_keywords(doc)
    assert len(keywords) == 6
    logging.info(keywords)


@pytest.mark.asyncio
async def test_extract_entities() -> None:
    doc = test_model.spacy(test_text)
    entities = await extract_entities(doc)
    assert len(entities) == 29
    logging.info(entities)


@pytest.mark.asyncio
async def test_summarize_doc() -> None:
    doc = test_model.spacy(test_text)
    summary = await summarize_doc(doc, 3)
    assert len(summary) == 1496
    logging.info(summary)


@pytest.mark.asyncio
async def test_extractive_summarization() -> None:
    doc = test_model.spacy(test_text)
    summary = await extractive_summarization(doc, list(test_model.spacy.Defaults.stop_words))
    assert len(summary) == 1070
    logging.info(summary)


@pytest.mark.asyncio
async def test_extract_claims() -> None:
    doc = test_model.spacy(test_text)
    claims = await extract_claims(doc, list(test_model.spacy.Defaults.stop_words), 0.4)
    assert len(claims) == 6
    logging.info(claims)


@pytest.mark.asyncio
async def test_extract_topics() -> None:
    model = AIModel("models/el.json")
    topics = await extract_topics(test_text, model.topic_classification_pipeline, model.tokenizer)
    logging.info(topics)
    assert len(topics) == 2


@pytest.mark.asyncio
async def test_summarize() -> None:
    doc = test_model.spacy(test_text)
    summary = await summarize(doc)
    assert len(summary) == 1027
    logging.info(summary)
