import spacy
import logging
from nlp.nlp import (
    extract_stopwords,
    extract_keywords,
    extract_entities,
    summarize_doc,
    extractive_summarization,
    extract_quotes,
    extract_claims
)

# test_text = 'Ο πρωθυπουργός παραδέχθηκε εμμέσως ότι η επιδότηση για τα καύσιμα και τα μέτρα κατά των ανατιμήσεων, είναι αυτά που επιβάλλουν τα δημοσιονομικά περιθώρια. Σταγόνα στον ωκεανό της ακρίβειας η κυβερνητική παρέμβαση. “Ουκ αν λάβοις παρά του μη έχοντος”: Η αρχαία αυτή ρήση έχει ουσιαστικά εφαρμογή και όσον αφορά στα μέτρα κατά της ακρίβειας, καθώς η επιδότηση στην τιμή των καυσίμων είναι μικρή σε σχέση με τις τεράστιες ανατιμήσεις με την κυβέρνηση να επικαλείται τα στενά δημοσιονομικά περιθώρια. Ο πρωθυπουργός Κυριάκος Μητσοτάκης μάλιστα στο χθεσινό του μήνυμα εν όψει των λεπτομερών ανακοινώσεων σήμερα, αξύριστος και ταλαιπωρημένος από τον κορονοϊό, έσπευσε χθες να προκαταλάβει τυχόν κριτική της αντιπολίτευσης για “ψίχουλα”, δηλώνοντας ότι και ο ίδιος θα ήθελε να δώσει ένα μεγαλύτερο πακέτο στήριξης. Τόνισε όμως ότι δεν μπορεί να θέσει σε κίνδυνο τη δημοσιονομική σταθερότητα και ότι δεν θα ξεπεράσει τις αντοχές της οικονομίας. Πολύ λίγα, πολύ αργά Σύμφωνα με πληροφορίες άλλωστε, στο οικονομικό επιτελείο είχαν επιφυλάξεις για τη δυνατότητα μέτρων στήριξης, καθώς δεν υπήρχαν περισσότερα χρήματα για να διατεθούν από το 1,1 δισ ευρώ που συνολικά θα δοθεί, ενώ το οικονομικό μέλλον είναι αβέβαιο. Η κυβέρνηση εξάλλου έχει ξεκαθαρίσει ότι δεν θα προχωρήσει σε μείωση του φόρου καυσίμων όπως έκανε πχ η Πορτογαλία, καθώς αποτελεί ένα πολύ μεγάλο μέρος των δημοσίων εσόδων. Επί της ουσίας ο κ.Μητσοτάκης εμμέσως παραδέχθηκε ότι τα νέα μέτρα προφανώς και δεν λύνουν το πρόβλημα, αλλά στην πραγματικότητα αποτελούν ένα μικρό βοήθημα, σταγόνα στον ωκεανό της ακρίβειας. Είναι ενδεικτικό ότι η επιδότηση σε βενζίνη κλπ αναμένεται να φτάσει τα 0,20 ευρώ το λίτρο, που σημαίνει περίπου 15 ευρώ το μήνα, ενώ ο “κόφτης” των 180 λίτρων σε βάθος τριμήνου δεν καλύπτει ούτε την ανάγκη σε καύσιμα για ένα μέσο ΙΧ το μήνα. Το πολιτικό μήνυμα του Μαξίμου λοιπόν είναι “κάνουμε ό,τι μπορούμε” και όχι τυχαία ο πρωθυπουργός κράτησε χαμηλούς τόνους στη χθεσινή του δήλωση. Δεν είναι τυχαίο επίσης ότι αναφέρθηκε στους ευάλωτους, αλλά και στη μεσαία τάξη, την οργή της οποίας φοβάται η κυβέρνηση. Αλλά και ότι δήλωσε πως “είναι η ώρα η πολιτική να θέσει κανόνες στις αγορές”, χωρίς να μπαίνει σε περισσότερες λεπτομέρειες επ’ αυτού. Ήδη άλλωστε ο πρωθυπουργός έχει κάνει λόγο για κερδοσκοπία στην αγορά καυσίμων και φυσικού αερίου. Το βλέμμα στην ΕΕ Ο κ.Μητσοτάκης στη δήλωση του χθες έδειξε επίσης ότι προσδοκά στην επικείμενη Σύνοδο Κορυφής της Ευρωπαϊκής Ένωσης στις 24 και 25 Μαρτίου να ληφθούν μέτρα σε ευρωπαϊκό επίπεδο για να συγκρατηθούν οι τιμές του φυσικού αερίου, του ηλεκτρικού ρεύματος και των καυσίμων εν γένει, καθώς και για να δοθεί η δυνατότητα στα κράτη- μέλη να δώσουν περισσότερα. Η προσδοκία αυτή “σκοντάφτει” όμως στις αντιρρήσεις της Γερμανίας, της Ολλανδίας και των λεγόμενων “φειδωλών” χωρών του Βορρά, που αντιδρούν και στο ευρωομόλογο, με το επιχείρημα ότι υπάρχουν ακόμη κονδύλια στο Ταμείο Ανάκαμψης. Το οποίο Ταμείο Ανάκαμψης όμως έχει τέτοιους όρους, που η εκταμίευση δεν είναι εύκολη υπόθεση. Το ζήτημα για την κυβέρνηση είναι επίσης ότι επικοινωνιακά περνά κάτω από τον πήχη που είχε θέσει η οριζόντια διάθεση 42 δισ ευρώ για μέτρα στήριξης την περίοδο της πανδημίας. Τότε βεβαίως, η δυνατότητα αυτή υπήρχε γιατί σε ευρωπαϊκό επίπεδο είχαν χαλαρώσει οι δημοσιονομικές πολιτικές. Ενώ τώρα, δεδομένου του μισοάδειου “κορβανά”, η κυβέρνηση επιλέγει πιο στοχευμένες δράσεις, προσπαθώντας όμως ταυτόχρονα να απευθυνθεί και στη μεσαία τάξη, έστω με μία μικρή επιδότηση για τα εισοδήματα μέχρι 30.000 ευρώ.'

test_text = "Οι φιλορώσοι αυτονομιστές αντάρτες στην ανατολική Ουκρανία κατηγόρησαν σήμερα τον στρατό ότι άνοιξε πυρ εναντίον της περιοχής που ελέγχουν τέσσερις φορές μέσα σε διάστημα 24 ωρών και πρόσθεσαν ότι προσπαθούν να βεβαιωθούν ότι δεν υπάρχουν θύματα. Δεν είναι ακόμη ξεκάθαρο πόσο σοβαρά είναι αυτά τα περιστατικά και προς το παρόν δεν έχει υπάρξει αντίδραση από την Ουκρανία ή τον Οργανισμό για την Ασφάλεια και τη Συνεργασία στην Ευρώπη (ΟΑΣΕ), ο οποίος παρακολουθεί την κατάσταση στην ανατολική Ουκρανία αλλά τις τελευταίες ημέρες έχει αποσύρει κάποιους από τους παρατηρητές του από την περιοχή. Τέτοιου είδους περιστατικά έχουν σημειωθεί πολλές φορές τα τελευταία οκτώ χρόνια, αλλά αυτό σημειώνεται σε μια περίοδο που η Ρωσία κατηγορείται ότι έχει συγκεντρώσει περισσότερους από 100.000 στρατιώτες στα σύνορά με την Ουκρανία και έχει αποσύρει κάποιους από τους παρατηρητές της τις τελευταίες ημέρες. Εκπρόσωποι της αυτοανακηρυχθείσας Λαϊκής Δημοκρατίας του Λουχάνσκ ανέφεραν σε ανακοίνωσή τους ότι οι ουκρανικές δυνάμεις χρησιμοποίησαν όλμους, εκτοξευτήρες ρουκετών και πολυβόλα σε τέσσερα ξεχωριστά περιστατικά σήμερα Πέμπτη. “ Οι ένοπλες δυνάμεις της Ουκρανίας έχουν παραβιάσει κατάφωρα το καθεστώς εκεχειρίας χρησιμοποιώντας βαρέα όπλα τα οποία, βάσει των συμφωνιών του Μινσκ, θα έπρεπε να έχουν αποσυρθεί”, τόνιζε η ανακοίνωση. Το Κίεβο αρνείται ότι στοχοθέτησε θέσεις των φιλορώσων αυτονομιστών ανταρτών στα ανατολικά Ο ουκρανικός στρατός διέψευσε σήμερα ότι στοχοθέτησε τους φιλορώσους αυτονομιστές αντάρτες στην ανατολική Ουρκανία. \"Παρά το γεγονός ότι οι θέσεις μας δέχθηκαν από απαγορευμένα όπλα, περιλαμβανομένων πυροβόλων 12 χιλιοστών, τα ουκρανικά στρατεύματα δεν απάντησαν στα πυρά\", δήλωσε στο Reuters ο υπεύθυνος Τύπου των ουκρανικών ενόπλων δυνάμεων. Νωρίτερα οι φιλορώσοι αυτονομιστές αντάρτες στην ανατολική Ουκρανία κατηγόρησαν τον στρατό ότι άνοιξε πυρ εναντίον της περιοχής που ελέγχουν τέσσερις φορές μέσα σε διάστημα 24 ωρών και πρόσθεσαν ότι προσπαθούν να βεβαιωθούν ότι δεν υπάρχουν θύματα. Δεν είναι ακόμη ξεκάθαρο πόσο σοβαρά είναι αυτά τα περιστατικά και προς το παρόν δεν έχει υπάρξει αντίδραση από την Ουκρανία ή τον Οργανισμό για την Ασφάλεια και τη Συνεργασία στην Ευρώπη (ΟΑΣΕ), ο οποίος παρακολουθεί την κατάσταση στην ανατολική Ουκρανία αλλά τις τελευταίες ημέρες έχει αποσύρει κάποιους από τους παρατηρητές του από την περιοχή. Τέτοιου είδους περιστατικά έχουν σημειωθεί πολλές φορές τα τελευταία οκτώ χρόνια, αλλά αυτό σημειώνεται σε μια περίοδο που η Ρωσία κατηγορείται ότι έχει συγκεντρώσει περισσότερους από 100.000 στρατιώτες στα σύνορά με την Ουκρανία και έχει αποσύρει κάποιους από τους παρατηρητές της τις τελευταίες ημέρες. Εκπρόσωποι της αυτοανακηρυχθείσας Λαϊκής Δημοκρατίας του Λουχάνσκ ανέφεραν σε ανακοίνωσή τους ότι οι ουκρανικές δυνάμεις χρησιμοποίησαν όλμους, εκτοξευτήρες ρουκετών και πολυβόλα σε τέσσερα ξεχωριστά περιστατικά σήμερα Πέμπτη. “ Οι ένοπλες δυνάμεις της Ουκρανίας έχουν παραβιάσει κατάφωρα το καθεστώς εκεχειρίας χρησιμοποιώντας βαρέα όπλα τα οποία, βάσει των συμφωνιών του Μινσκ, θα έπρεπε να έχουν αποσυρθεί”, τόνιζε η ανακοίνωση. Σύμφωνα με τον Γιαν Λεστσένκο επικεφαλής της λαϊκής πολιτοφυλακής του Λουχάνσκ, \"τις τελευταίες 24 ώρες η κατάσταση στη γραμμή επαφής έχει επιδεινωθεί σημαντικά. Ο εχθρός, υπό την άμεση εντολή της πολιτικοστρατιωτικής ηγεσίας του Κιέβου, προσπαθεί να κλιμακώσει τη σύγκρουση\". Παράλληλα η λαϊκή πολιτοφυλακή της αυτοανακηρυχθείσας Λαϊκής Δημοκρατίας του Ντονέτσκ ανακοίνωσε σήμερα ότι μονάδες της απάντησαν σε πυρά που δέχθηκαν από τις ουκρανικές δυνάμεις ασφαλείας. “ Προκειμένου να προστατεύσουμε τον άμαχο πληθυσμό, οι υπερασπιστές μας αναγκάστηκαν να απαντήσουν στα πυρά (...) Δεν υπάρχουν ακόμη πληροφορίες για θύματα ή ζημιές στις πολιτικές υποδομές”, επεσήμανε ο εκπρόσωπος της πολιτοφυλακής."


def test_extract_quotes():
    quotes = extract_quotes(test_text)
    assert len(quotes) == 4
    logging.info(quotes)


def test_extract_stopwords(caplog):
    caplog.set_level(logging.INFO)
    test_spacy_model = spacy.load("el_core_news_md")

    stopwords = extract_stopwords(test_text, list(test_spacy_model.Defaults.stop_words))
    assert len(stopwords) == 163
    logging.getLogger().info(stopwords)


def test_extract_keywords():
    test_spacy_model = spacy.load("el_core_news_md")
    doc = test_spacy_model(test_text)
    keywords = extract_keywords(doc)
    assert len(keywords) == 6
    logging.info(keywords)


def test_extract_entities():
    test_spacy_model = spacy.load("el_core_news_md")
    doc = test_spacy_model(test_text)
    entities = extract_entities(doc)
    assert len(entities) == 12
    logging.info(entities)


def test_summarize_doc():
    test_spacy_model = spacy.load("el_core_news_md")
    doc = test_spacy_model(test_text)
    summary = summarize_doc(doc, 3)
    assert len(summary) == 1552
    logging.info(summary)


def test_extractive_summarization():
    test_spacy_model = spacy.load("el_core_news_md")
    doc = test_spacy_model(test_text)
    summary = extractive_summarization(doc, list(test_spacy_model.Defaults.stop_words))
    assert len(summary) == 1070
    logging.info(summary)


def test_extract_claims():
    test_spacy_model = spacy.load("el_core_news_md")
    doc = test_spacy_model(test_text)
    claims = extract_claims(doc, list(test_spacy_model.Defaults.stop_words), 0.4)
    assert len(claims) == 4
    logging.info(claims)
