const { trimRight, normalizeString } = require('../src/utils/strings');

const passages = [
	{
	  deleted: false,
	  text: 'Το σύνολο του περιεχομένου και των υπηρεσιών του capitano.gr διατίθεται στους επισκέπτες για προσωπική χρήση',
	  type: 'trim'
	},
	{
	  deleted: false,
	  text: "Το thebest.gr δεν υιοθετεί κατ' ανάγκην, τα σχόλια των αναγνωστών και σε περιπτώσεις υβριστικών, χυδαίων και ανακριβών πληροφοριών θα τα διαγράφει. ",
	  type: 'trim'
	},
	{
	  deleted: false,
	  text: 'Καλή ακρόαση! Θα πρέπει να συνδεθείτε για να διαβάσετε το υπόλοιπο.',
	  type: 'trim'
	},
	{
	  deleted: false,
	  text: 'Τα cookies είναι σημαντικά για την εύρυθμη λειτουργία του site μας και τη βελτίωση',
	  type: 'trim'
	},
	{
	  deleted: false,
	  text: 'Πηγή:',
	  type: 'trim'
	},
];


const article = {
	body: '<div> <p>Ο Κώστας Τουρνάς έδωσε συνέντευξη στην εκπομπή «Mega Καλημέρα» και τον Θανάση Πάτρα. Ο αγαπημένος καλλιτέχνης μίλησε για την καριέρα του, την τραπ μουσική και τοποθετήθηκε για συναδέλφους του.</p> <div> <p>«Έγραφα τραγούδια για τις λαϊκές τραγουδίστριες με το ψευδώνυμο “Τ. Κωστής”, δεν ήξεραν πως είμαι εγώ αυτός που γράφει τα τραγούδια. Ένα κάλο τραγούδι, είναι κάλο τραγούδι πάντα, ανεξαρτήτως σε ποιο είδος κατατάσσεται. Ο καλλιτέχνης αγαπιέται μέσω των τραγουδιών του, οι μεγάλοι ερμηνευτές έχουν μεγάλη έγνοια τι θα πουν. Όταν μου είπαν πως στα 42 μου τέλειωσα καλλιτεχνικά, μέσα μου γέλασα. Όταν ήμουν 23 έλεγαν ότι είμαι ομοφυλόφιλος, τότε ήταν εξαιρετικά κατακριτέο, δε με αφορά», είπε αρχικά ο Κώστας Τουρνάς.</p> <p>Για την τραπ μουσική, ο Κώστας Τουρνάς ανέφερε: «Είμαι θετικός να πάρει ένα τραγούδι μου τραπ μορφή εφόσον το εγκρίνω. Η τραπ μουσική δεν είναι κάτι που αγαπώ, δε θα την χρησιμοποιούσα ως εκφραστικό μέσο. Είναι προφανές ότι υπάρχει θυμός σε αυτήν τη γενιά. Δεν έχω πει ότι δε μου αρέσει ο θυμός, αλλά από πού γεννιέται; Κάποιοι θέλουν να βρίσουν και είναι επιθετικοί».</p> <p>Για συναδέλφους του, ο Κώστας Τουρνάς είπε: «Αν δεν είχε τραγουδηθεί το ‘Άστην να λέει’ μπορεί να μην είχαμε την εξέλιξη που είχαμε σαν συγκρότημα. Μου αρέσει πολύ ο Νίκος Οικονομόπουλος, είναι απίστευτος, εξαιρετικός. Ο Ρέμος έχει εξαιρετική ικανότητα, δεν ξέρω ποιον θα ακούμε σε 20 χρόνια. Δεν τρελαίνομαι για ερωτικούς στίχους και καψούρα, δε με αφορά αυτό. Όταν μου ζήτησε η Καίτη Γαρμπή να της γράψω τραγούδια, το έκανα μέσα σε λίγες ώρες.</p> <p>Το πρώτο που της έγραψα ήταν το ‘Μη με συγκρίνεις΄. Έγραψα στην Καίτη Γαρμπή το τραγούδι ‘Και αν ξυπόλητη χορεύω’ γιατί είχε νέα σχέση. Το τραγούδι ‘Ο Αχιλλέας από το Κάιρο’ δεν το έγραψα απαραίτητα για τον Γιώργο Μαρίνο, ήταν γύρω από αυτόν. Για έμενα η αποδοχή προς έναν άνθρωπο είναι να αισθάνομαι πως δικαίως να υπάρχεις χωρίς αρνητική επέμβαση από έμενα».</p> <p>Κλείνοντας, ο Κώστας Τουρνάς μίλησε για την τηλεόραση: «Η σημερινή τηλεόραση έχει τα χαρακτηριστικά του ‘fast food’. Δεν έχει ανάγκη από ανθρώπους που θα συνεισφέρουν το κάτι παραπάνω. Μπορεί και να πήγαινα σε talent show αν ήμουν 20, για να κάνω κάτι εξαρτάται από την απόγνωση και τα αδιέξοδα που θα έχω βρεθεί».</p> </div> <p>Πηγή: <a href="https://www.zappit.gr/psychagogia/kostas-tournas-otan-imoun-23-elegan-oti-eimai-omofylofilos-tote-itan-eksairetika-katakriteo/3421365" rel="nofollow">zappit.gr</a></p> </div>',
	text: 'Ο Κώστας Τουρνάς έδωσε συνέντευξη στην εκπομπή «Mega Καλημέρα» και τον Θανάση Πάτρα. Ο αγαπημένος καλλιτέχνης μίλησε για την καριέρα του, την τραπ μουσική και τοποθετήθηκε για συναδέλφους του. «Έγραφα τραγούδια για τις λαϊκές τραγουδίστριες με το ψευδώνυμο “Τ. Κωστής”, δεν ήξεραν πως είμαι εγώ αυτός που γράφει τα τραγούδια. Ένα κάλο τραγούδι, είναι κάλο τραγούδι πάντα, ανεξαρτήτως σε ποιο είδος κατατάσσεται. Ο καλλιτέχνης αγαπιέται μέσω των τραγουδιών του, οι μεγάλοι ερμηνευτές έχουν μεγάλη έγνοια τι θα πουν. Όταν μου είπαν πως στα 42 μου τέλειωσα καλλιτεχνικά, μέσα μου γέλασα. Όταν ήμουν 23 έλεγαν ότι είμαι ομοφυλόφιλος, τότε ήταν εξαιρετικά κατακριτέο, δε με αφορά», είπε αρχικά ο Κώστας Τουρνάς. Για την τραπ μουσική, ο Κώστας Τουρνάς ανέφερε: «Είμαι θετικός να πάρει ένα τραγούδι μου τραπ μορφή εφόσον το εγκρίνω. Η τραπ μουσική δεν είναι κάτι που αγαπώ, δε θα την χρησιμοποιούσα ως εκφραστικό μέσο. Είναι προφανές ότι υπάρχει θυμός σε αυτήν τη γενιά. Δεν έχω πει ότι δε μου αρέσει ο θυμός, αλλά από πού γεννιέται; Κάποιοι θέλουν να βρίσουν και είναι επιθετικοί». Για συναδέλφους του, ο Κώστας Τουρνάς είπε: «Αν δεν είχε τραγουδηθεί το ‘Άστην να λέει’ μπορεί να μην είχαμε την εξέλιξη που είχαμε σαν συγκρότημα. Μου αρέσει πολύ ο Νίκος Οικονομόπουλος, είναι απίστευτος, εξαιρετικός. Ο Ρέμος έχει εξαιρετική ικανότητα, δεν ξέρω ποιον θα ακούμε σε 20 χρόνια. Δεν τρελαίνομαι για ερωτικούς στίχους και καψούρα, δε με αφορά αυτό. Όταν μου ζήτησε η Καίτη Γαρμπή να της γράψω τραγούδια, το έκανα μέσα σε λίγες ώρες. Το πρώτο που της έγραψα ήταν το ‘Μη με συγκρίνεις΄. Έγραψα στην Καίτη Γαρμπή το τραγούδι ‘Και αν ξυπόλητη χορεύω’ γιατί είχε νέα σχέση. Το τραγούδι ‘Ο Αχιλλέας από το Κάιρο’ δεν το έγραψα απαραίτητα για τον Γιώργο Μαρίνο, ήταν γύρω από αυτόν. Για έμενα η αποδοχή προς έναν άνθρωπο είναι να αισθάνομαι πως δικαίως να υπάρχεις χωρίς αρνητική επέμβαση από έμενα». Κλείνοντας, ο Κώστας Τουρνάς μίλησε για την τηλεόραση: «Η σημερινή τηλεόραση έχει τα χαρακτηριστικά του ‘fast food’. Δεν έχει ανάγκη από ανθρώπους που θα συνεισφέρουν το κάτι παραπάνω. Μπορεί και να πήγαινα σε talent show αν ήμουν 20, για να κάνω κάτι εξαρτάται από την απόγνωση και τα αδιέξοδα που θα έχω βρεθεί». Πηγή: zappit.gr',
	author: 'y.michaelides',
	date: null,
	description: '',
	keywords: null,
	title: 'Κώστας Τουρνάς: «Όταν ήμουν 23, έλεγαν ότι είμαι ομοφυλόφιλος, τότε ήταν εξαιρετικά κατακριτέο»',
	url: null,
	lang: 'el',
	image: 'https://www.editorial.gr/wp-content/uploads/2024/02/tournas82.jpg',
	logo: null,
	publisher: 'editorial.gr'
};

article.text = trimRight(article.text, passages);
article.text = normalizeString(article.text);
console.log(article.text);
